In [1]:
import pandas as pd

In [2]:
df =  pd.DataFrame([[1,2,3,4], [5,6,7,8],[3,6,8,23],[23,62,58,59]], columns=['A1', 'B1','C1', 'D1'])

In [3]:
df

   A1  B1  C1  D1
0   1   2   3   4
1   5   6   7   8
2   3   6   8  23
3  23  62  58  59

In [4]:
df.head()

   A1  B1  C1  D1
0   1   2   3   4
1   5   6   7   8
2   3   6   8  23
3  23  62  58  59

In [6]:
df.to_csv('export.csv', index=False)